from src.text_review import analyze_call

text = """Доброго дня, менеджер Багданського ФРС.

Доброго вечора, Чувана.

Що за автомобіль?

BMW 5 серії, F10.

F10.

Так, так, так.

Менеджер: Дитя, можу запропонувати вам на п'ятницю на 10 ранку.
Клієнт: А так взагалі дні будні після 17-ї зайняті у вас всі, так?
Менеджер: Ну, так. Наприклад, сьогодні записи майже на цілий день.
Клієнт: Тобто там п'ята-шоста години залишились. І на завтра так само, в принципі.
Менеджер: А п'ята-шоста, ви кажете, залишились. Тобто на шосту можна сьогодні пригнати?
Клієнт: Сьогодні не вийде пригнати автомобіль. Сьогодні день не висписаний.
Менеджер: А завтра, наприклад, на четверту можна буде.
Клієнт: Завтра на четверту.
Менеджер: Добре, треба трохи зорієнтуватись. Я так розумію, просадись.
Клієнт: Треба вас перепитати. Це неможливо, так, записатися так, день в день, взагалі так, по Києву.
Менеджер: Зазвичай, бувають випадки, коли можна.
Клієнт: Бувають випадки, у нас виходить четверта станція у Києві.
Менеджер: Зазвичай на сьогодні, тобто день висписаний. Але бувають випадки, коли є місце.
Клієнт: Зараз зорієнту відмовляються, бо ще якась ситуація. Але я приконував би хоча б за день телефонувати.
Менеджер: Ну, давайте завтра на четверту спробуємо. А підхідь від себе, будь ласка.

Чи можна у вас таке питання задати?
Дивіться, я вчора вечір їздив, все було нормально, нічого не цей. Вранці спускаюсь, з машини така калюжа стійка. Ну, знаєте, от протікло так. Ну, пальцями мацаю, ну, це охолоджує ще речовина. І включаю заводжу авто, і вискакує мені, що рівень глядини недостатній. Мало лишилось, треба долити.
Менеджер: Підкажіть, от якщо долити, ну, тобто то, що стікає, я розумію, що це вже не ок. Але якщо долити, то можна ще на неї там ввечері поїздити чи взагалі їздити?
Клієнт: Дивіться, ніхто не знає, що у вас тече. Це ж нічого там, прям такого, тотально страшного? Ну, типу, взагалі, в цілому, знаєте?
Менеджер: Це серйозна проблема, але, в принципі, їздити можна. Якщо ви будете продовжувати їздити на сильному підтіканні, це може призвести до перегріву двигуну.
Клієнт: Ну, знаєте, я, напевно, не так трошки зрозуміли. Ну, це не проблема у рівні, там, знаєте, от. Немає навіть такої ваги.
Менеджер: Та фактом ми не знаємо, що там. Блін, просто от передпродажну перевірку робили, то наче не було таких проблем. Це шо, я десь мог так... Рішено все, тоді просто, можливо, один із патрубків лопнув, бо щось таке.
Клієнт: Проблема.

Догобренько. Ну, зараз я вам тоді все скину в телеграм. Добре?
Клієнт: Так, добре, тоді чекаю передовнення.
Менеджер: Все, дякую. Щасливо.
Клієнт: Дякую."""
result = analyze_call(text)

import json
print(json.dumps(result, ensure_ascii=False, indent=2))